Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.1.98/samrh71c/svd/ATSAMRH71F20C.svd
            <register>
               <name>FLEX_SPI_IER</name>
               <description>SPI Interrupt Enable Register</description>
               <addressOffset>0x414</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RDRF</name>
                     <description>Receive Data Register Full Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TDRE</name>
                     <description>SPI Transmit Data Register Empty Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MODF</name>
                     <description>Mode Fault Error Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRES</name>
                     <description>Overrun Error Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NSSR</name>
                     <description>NSS Rising Interrupt Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>Transmission Registers Empty Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNDES</name>
                     <description>Underrun Error Interrupt Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP</name>
                     <description>Comparison Interrupt Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFEF</name>
                     <description>TXFEF Interrupt Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFFF</name>
                     <description>TXFFF Interrupt Enable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFTHF</name>
                     <description>TXFTHF Interrupt Enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFEF</name>
                     <description>RXFEF Interrupt Enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFFF</name>
                     <description>RXFFF Interrupt Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFTHF</name>
                     <description>RXFTHF Interrupt Enable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFPTEF</name>
                     <description>TXFPTEF Interrupt Enable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFPTEF</name>
                     <description>RXFPTEF Interrupt Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_SPI_IDR</name>
               <description>SPI Interrupt Disable Register</description>
               <addressOffset>0x418</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RDRF</name>
                     <description>Receive Data Register Full Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TDRE</name>
                     <description>SPI Transmit Data Register Empty Interrupt Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MODF</name>
                     <description>Mode Fault Error Interrupt Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRES</name>
                     <description>Overrun Error Interrupt Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NSSR</name>
                     <description>NSS Rising Interrupt Disable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>Transmission Registers Empty Disable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNDES</name>
                     <description>Underrun Error Interrupt Disable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP</name>
                     <description>Comparison Interrupt Disable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFEF</name>
                     <description>TXFEF Interrupt Disable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFFF</name>
                     <description>TXFFF Interrupt Disable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFTHF</name>
                     <description>TXFTHF Interrupt Disable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFEF</name>
                     <description>RXFEF Interrupt Disable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFFF</name>
                     <description>RXFFF Interrupt Disable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFTHF</name>
                     <description>RXFTHF Interrupt Disable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFPTEF</name>
                     <description>TXFPTEF Interrupt Disable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFPTEF</name>
                     <description>RXFPTEF Interrupt Disable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_SPI_IMR</name>
               <description>SPI Interrupt Mask Register</description>
               <addressOffset>0x41C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RDRF</name>
                     <description>Receive Data Register Full Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TDRE</name>
                     <description>SPI Transmit Data Register Empty Interrupt Mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MODF</name>
                     <description>Mode Fault Error Interrupt Mask</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRES</name>
                     <description>Overrun Error Interrupt Mask</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NSSR</name>
                     <description>NSS Rising Interrupt Mask</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>Transmission Registers Empty Mask</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNDES</name>
                     <description>Underrun Error Interrupt Mask</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP</name>
                     <description>Comparison Interrupt Mask</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFEF</name>
                     <description>TXFEF Interrupt Mask</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFFF</name>
                     <description>TXFFF Interrupt Mask</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFTHF</name>
                     <description>TXFTHF Interrupt Mask</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFEF</name>
                     <description>RXFEF Interrupt Mask</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFFF</name>
                     <description>RXFFF Interrupt Mask</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFTHF</name>
                     <description>RXFTHF Interrupt Mask</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFPTEF</name>
                     <description>TXFPTEF Interrupt Mask</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFPTEF</name>
                     <description>RXFPTEF Interrupt Mask</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>FLEX_SPI_CSR[%s]</name>
               <description>SPI Chip Select Register</description>
               <addressOffset>0x430</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CPOL</name>
                     <description>Clock Polarity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NCPHA</name>
                     <description>Clock Phase</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSNAAT</name>
                     <description>Chip Select Not Active After Transfer (Ignored if CSAAT = 1)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSAAT</name>
                     <description>Chip Select Active After Transfer</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BITS</name>
                     <description>Bits Per Transfer</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>BITSSelect</name>
                        <enumeratedValue>
                           <name>_8_BIT</name>
                           <description>8 bits for transfer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_9_BIT</name>
                           <description>9 bits for transfer</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_10_BIT</name>
                           <description>10 bits for transfer</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_11_BIT</name>
                           <description>11 bits for transfer</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_12_BIT</name>
                           <description>12 bits for transfer</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_13_BIT</name>
                           <description>13 bits for transfer</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_14_BIT</name>
                           <description>14 bits for transfer</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_15_BIT</name>
                           <description>15 bits for transfer</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16_BIT</name>
                           <description>16 bits for transfer</description>
                           <value>0x8</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SCBR</name>
                     <description>Serial Clock Bit Rate</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DLYBS</name>
                     <description>Delay Before SPCK</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DLYBCT</name>
                     <description>Delay Between Consecutive Transfers</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_SPI_FMR</name>
               <description>SPI FIFO Mode Register</description>
               <addressOffset>0x440</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TXRDYM</name>
                     <description>Transmit Data Register Empty Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TXRDYMSelect</name>
                        <enumeratedValue>
                           <name>ONE_DATA</name>
                           <description>TDRE will be at level '1' when at least one data can be written in the Transmit FIFO.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TWO_DATA</name>
                           <description>TDRE will be at level '1' when at least two data can be written in the Transmit FIFO.Cannot be used if FLEX_SPI_MR.PS =1.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXRDYM</name>
                     <description>Receive Data Register Full Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>RXRDYMSelect</name>
                        <enumeratedValue>
                           <name>ONE_DATA</name>
                           <description>RDRF will be at level '1' when at least one unread data is in the Receive FIFO.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TWO_DATA</name>
                           <description>RDRF will be at level '1' when at least two unread data are in the Receive FIFO.Cannot be used when FLEX_SPI_MR.MSTR =1, or if FLEX_SPI_MR.PS =1.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FOUR_DATA</name>
                           <description>RDRF will be at level '1' when at least four unread data are in the Receive FIFO.Cannot be used when FLEX_SPI_CSRx.BITS is greater than 0, or if FLEX_SPI_MR.MSTR =1, or if FLEX_SPI_MR.PS =1.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXFTHRES</name>
                     <description>Transmit FIFO Threshold</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>RXFTHRES</name>
                     <description>Receive FIFO Threshold</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_SPI_FLR</name>
               <description>SPI FIFO Level Register</description>
               <addressOffset>0x444</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXFL</name>
                     <description>Transmit FIFO Level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>RXFL</name>
                     <description>Receive FIFO Level</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_SPI_CMPR</name>
               <description>SPI Comparison Register</description>
               <addressOffset>0x448</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VAL1</name>
                     <description>First Comparison Value for Received Character</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>VAL2</name>
                     <description>Second Comparison Value for Received Character</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
