Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.1.98/samrh71c/svd/ATSAMRH71F20C.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>HSMC</name>
         <version>44128A</version>
         <description>Harden Static Memory Controller</description>
         <groupName>HSMC</groupName>
         <prependToName>HSMC_</prependToName>
         <baseAddress>0x40081000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x78</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>HSMC_SETUP0</name>
               <description>HSMC Setup Register (CS_number = 0)</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NWE_SETUP</name>
                     <description>NWE Setup Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>NCS_WR_SETUP</name>
                     <description>NCS Setup Length in WRITE Access</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>NRD_SETUP</name>
                     <description>NRD Setup Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>NCS_RD_SETUP</name>
                     <description>NCS Setup Length in READ Access</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_PULSE0</name>
               <description>HSMC Pulse Register (CS_number = 0)</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NWE_PULSE</name>
                     <description>NWE Pulse Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>NCS_WR_PULSE</name>
                     <description>NCS Pulse Length in WRITE Access</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>NRD_PULSE</name>
                     <description>NRD Pulse Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>NCS_RD_PULSE</name>
                     <description>NCS Pulse Length in READ Access</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_CYCLE0</name>
               <description>HSMC Cycle Register (CS_number = 0)</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NWE_CYCLE</name>
                     <description>Total Write Cycle Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>NRD_CYCLE</name>
                     <description>Total Read Cycle Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_MODE0</name>
               <description>HSMC Mode Register (CS_number = 0)</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>READ_MODE</name>
                     <description>Read Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRITE_MODE</name>
                     <description>Write Mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RMW_ENABLE</name>
                     <description>Read-Modify Write enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXNW_MODE</name>
                     <description>NWAIT Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>EXNW_MODESelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Disabled-The NWAIT input signal is ignored on the corresponding chip select.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FROZEN</name>
                           <description>Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>READY</name>
                           <description>Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DBW</name>
                     <description>Data Bus Width</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DBWSelect</name>
                        <enumeratedValue>
                           <name>_8_BIT</name>
                           <description>8-bit Data Bus</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16_BIT</name>
                           <description>16-bit Data Bus</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32_BIT</name>
                           <description>32-bit Data Bus</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SETUP1</name>
               <description>HSMC Setup Register (CS_number = 1)</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NWE_SETUP</name>
                     <description>NWE Setup Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>NCS_WR_SETUP</name>
                     <description>NCS Setup Length in WRITE Access</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>NRD_SETUP</name>
                     <description>NRD Setup Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>NCS_RD_SETUP</name>
                     <description>NCS Setup Length in READ Access</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_PULSE1</name>
               <description>HSMC Pulse Register (CS_number = 1)</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NWE_PULSE</name>
                     <description>NWE Pulse Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>NCS_WR_PULSE</name>
                     <description>NCS Pulse Length in WRITE Access</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>NRD_PULSE</name>
                     <description>NRD Pulse Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>NCS_RD_PULSE</name>
                     <description>NCS Pulse Length in READ Access</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_CYCLE1</name>
               <description>HSMC Cycle Register (CS_number = 1)</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NWE_CYCLE</name>
                     <description>Total Write Cycle Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>NRD_CYCLE</name>
                     <description>Total Read Cycle Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_MODE1</name>
               <description>HSMC Mode Register (CS_number = 1)</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>READ_MODE</name>
                     <description>Read Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRITE_MODE</name>
                     <description>Write Mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RMW_ENABLE</name>
                     <description>Read-Modify Write enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXNW_MODE</name>
                     <description>NWAIT Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>EXNW_MODESelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Disabled-The NWAIT input signal is ignored on the corresponding chip select.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FROZEN</name>
                           <description>Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>READY</name>
                           <description>Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DBW</name>
                     <description>Data Bus Width</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DBWSelect</name>
                        <enumeratedValue>
                           <name>_8_BIT</name>
                           <description>8-bit Data Bus</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16_BIT</name>
                           <description>16-bit Data Bus</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32_BIT</name>
                           <description>32-bit Data Bus</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SETUP2</name>
               <description>HSMC Setup Register (CS_number = 2)</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NWE_SETUP</name>
                     <description>NWE Setup Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>NCS_WR_SETUP</name>
                     <description>NCS Setup Length in WRITE Access</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>NRD_SETUP</name>
                     <description>NRD Setup Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>NCS_RD_SETUP</name>
                     <description>NCS Setup Length in READ Access</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_PULSE2</name>
               <description>HSMC Pulse Register (CS_number = 2)</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NWE_PULSE</name>
                     <description>NWE Pulse Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>NCS_WR_PULSE</name>
                     <description>NCS Pulse Length in WRITE Access</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>NRD_PULSE</name>
                     <description>NRD Pulse Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>NCS_RD_PULSE</name>
                     <description>NCS Pulse Length in READ Access</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_CYCLE2</name>
               <description>HSMC Cycle Register (CS_number = 2)</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NWE_CYCLE</name>
                     <description>Total Write Cycle Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>NRD_CYCLE</name>
                     <description>Total Read Cycle Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_MODE2</name>
               <description>HSMC Mode Register (CS_number = 2)</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>READ_MODE</name>
                     <description>Read Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRITE_MODE</name>
                     <description>Write Mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RMW_ENABLE</name>
                     <description>Read-Modify Write enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXNW_MODE</name>
                     <description>NWAIT Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>EXNW_MODESelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Disabled-The NWAIT input signal is ignored on the corresponding chip select.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FROZEN</name>
                           <description>Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>READY</name>
                           <description>Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DBW</name>
                     <description>Data Bus Width</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DBWSelect</name>
                        <enumeratedValue>
                           <name>_8_BIT</name>
                           <description>8-bit Data Bus</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16_BIT</name>
                           <description>16-bit Data Bus</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32_BIT</name>
                           <description>32-bit Data Bus</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SETUP3</name>
               <description>HSMC Setup Register (CS_number = 3)</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NWE_SETUP</name>
                     <description>NWE Setup Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>NCS_WR_SETUP</name>
                     <description>NCS Setup Length in WRITE Access</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>NRD_SETUP</name>
                     <description>NRD Setup Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>NCS_RD_SETUP</name>
                     <description>NCS Setup Length in READ Access</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
