Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.1.98/samrh71c/svd/ATSAMRH71F20C.svd
            <register>
               <name>IP1553_TXBSR</name>
               <description>Tx Buffer Status Register</description>
               <addressOffset>0x4C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TF0</name>
                     <description>Transmit buffer 0, x with x=[0-31]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF1</name>
                     <description>Transmit buffer 1, x with x=[0-31]</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF2</name>
                     <description>Transmit buffer 2, x with x=[0-31]</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF3</name>
                     <description>Transmit buffer 3, x with x=[0-31]</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF4</name>
                     <description>Transmit buffer 4, x with x=[0-31]</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF5</name>
                     <description>Transmit buffer 5, x with x=[0-31]</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF6</name>
                     <description>Transmit buffer 6, x with x=[0-31]</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF7</name>
                     <description>Transmit buffer 7, x with x=[0-31]</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF8</name>
                     <description>Transmit buffer 8, x with x=[0-31]</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF9</name>
                     <description>Transmit buffer 9, x with x=[0-31]</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF10</name>
                     <description>Transmit buffer 10, x with x=[0-31]</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF11</name>
                     <description>Transmit buffer 11, x with x=[0-31]</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF12</name>
                     <description>Transmit buffer 12, x with x=[0-31]</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF13</name>
                     <description>Transmit buffer 13, x with x=[0-31]</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF14</name>
                     <description>Transmit buffer 14, x with x=[0-31]</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF15</name>
                     <description>Transmit buffer 15, x with x=[0-31]</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF16</name>
                     <description>Transmit buffer 16, x with x=[0-31]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF17</name>
                     <description>Transmit buffer 17, x with x=[0-31]</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF18</name>
                     <description>Transmit buffer 18, x with x=[0-31]</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF19</name>
                     <description>Transmit buffer 19, x with x=[0-31]</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF20</name>
                     <description>Transmit buffer 20, x with x=[0-31]</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF21</name>
                     <description>Transmit buffer 21, x with x=[0-31]</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF22</name>
                     <description>Transmit buffer 22, x with x=[0-31]</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF23</name>
                     <description>Transmit buffer 23, x with x=[0-31]</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF24</name>
                     <description>Transmit buffer 24, x with x=[0-31]</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF25</name>
                     <description>Transmit buffer 25, x with x=[0-31]</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF26</name>
                     <description>Transmit buffer 26, x with x=[0-31]</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF27</name>
                     <description>Transmit buffer 27, x with x=[0-31]</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF28</name>
                     <description>Transmit buffer 28, x with x=[0-31]</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF29</name>
                     <description>Transmit buffer 29, x with x=[0-31]</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF30</name>
                     <description>Transmit buffer 30, x with x=[0-31]</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF31</name>
                     <description>Transmit buffer 31, x with x=[0-31]</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IP1553_TXBAER</name>
               <description>Tx Buffer Access Error Register</description>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TER0</name>
                     <description>Transmit error 0, x with x=[0-31]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER1</name>
                     <description>Transmit error 1, x with x=[0-31]</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER2</name>
                     <description>Transmit error 2, x with x=[0-31]</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER3</name>
                     <description>Transmit error 3, x with x=[0-31]</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER4</name>
                     <description>Transmit error 4, x with x=[0-31]</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER5</name>
                     <description>Transmit error 5, x with x=[0-31]</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER6</name>
                     <description>Transmit error 6, x with x=[0-31]</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER7</name>
                     <description>Transmit error 7, x with x=[0-31]</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER8</name>
                     <description>Transmit error 8, x with x=[0-31]</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER9</name>
                     <description>Transmit error 9, x with x=[0-31]</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER10</name>
                     <description>Transmit error 10, x with x=[0-31]</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER11</name>
                     <description>Transmit error 11, x with x=[0-31]</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER12</name>
                     <description>Transmit error 12, x with x=[0-31]</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER13</name>
                     <description>Transmit error 13, x with x=[0-31]</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER14</name>
                     <description>Transmit error 14, x with x=[0-31]</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER15</name>
                     <description>Transmit error 15, x with x=[0-31]</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER16</name>
                     <description>Transmit error 16, x with x=[0-31]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER17</name>
                     <description>Transmit error 17, x with x=[0-31]</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER18</name>
                     <description>Transmit error 18, x with x=[0-31]</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER19</name>
                     <description>Transmit error 19, x with x=[0-31]</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER20</name>
                     <description>Transmit error 20, x with x=[0-31]</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER21</name>
                     <description>Transmit error 21, x with x=[0-31]</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER22</name>
                     <description>Transmit error 22, x with x=[0-31]</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER23</name>
                     <description>Transmit error 23, x with x=[0-31]</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER24</name>
                     <description>Transmit error 24, x with x=[0-31]</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER25</name>
                     <description>Transmit error 25, x with x=[0-31]</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER26</name>
                     <description>Transmit error 26, x with x=[0-31]</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER27</name>
                     <description>Transmit error 27, x with x=[0-31]</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER28</name>
                     <description>Transmit error 28, x with x=[0-31]</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER29</name>
                     <description>Transmit error 29, x with x=[0-31]</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER30</name>
                     <description>Transmit error 30, x with x=[0-31]</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TER31</name>
                     <description>Transmit error 31, x with x=[0-31]</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
