Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.1.98/samrh71c/svd/ATSAMRH71F20C.svd
            <register>
               <name>MATRIX_SCFG15</name>
               <description>Slave Configuration Register 15</description>
               <addressOffset>0x7C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SLOT_CYCLE</name>
                     <description>Maximum Bus Grant Duration for Masters</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>DEFMSTR_TYPE</name>
                     <description>Default Master Type</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DEFMSTR_TYPESelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LAST</name>
                           <description>Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FIXED</name>
                           <description>Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FIXED_DEFMSTR</name>
                     <description>Fixed Default Master</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PRAS0</name>
               <description>Priority Register A for Slave 0</description>
               <addressOffset>0x0080</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>M0PR</name>
                     <description>Master 0 Priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN0</name>
                     <description>Latency Quality of Service Enable for Master 0</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M1PR</name>
                     <description>Master 1 Priority</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN1</name>
                     <description>Latency Quality of Service Enable for Master 1</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M2PR</name>
                     <description>Master 2 Priority</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN2</name>
                     <description>Latency Quality of Service Enable for Master 2</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M3PR</name>
                     <description>Master 3 Priority</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN3</name>
                     <description>Latency Quality of Service Enable for Master 3</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M4PR</name>
                     <description>Master 4 Priority</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN4</name>
                     <description>Latency Quality of Service Enable for Master 4</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M5PR</name>
                     <description>Master 5 Priority</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN5</name>
                     <description>Latency Quality of Service Enable for Master 5</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M6PR</name>
                     <description>Master 6 Priority</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN6</name>
                     <description>Latency Quality of Service Enable for Master 6</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M7PR</name>
                     <description>Master 7 Priority</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN7</name>
                     <description>Latency Quality of Service Enable for Master 7</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PRBS0</name>
               <description>Priority Register B for Slave 0</description>
               <addressOffset>0x0084</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>M8PR</name>
                     <description>Master 8 Priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN8</name>
                     <description>Latency Quality of Service Enable for Master 8</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M9PR</name>
                     <description>Master 9 Priority</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN9</name>
                     <description>Latency Quality of Service Enable for Master 9</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M10PR</name>
                     <description>Master 10 Priority</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN10</name>
                     <description>Latency Quality of Service Enable for Master 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M11PR</name>
                     <description>Master 11 Priority</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN11</name>
                     <description>Latency Quality of Service Enable for Master 11</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M12PR</name>
                     <description>Master 12 Priority</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN12</name>
                     <description>Latency Quality of Service Enable for Master 12</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M13PR</name>
                     <description>Master 13 Priority</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN13</name>
                     <description>Latency Quality of Service Enable for Master 13</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M14PR</name>
                     <description>Master 14 Priority</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN14</name>
                     <description>Latency Quality of Service Enable for Master 14</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M15PR</name>
                     <description>Master 15 Priority</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN15</name>
                     <description>Latency Quality of Service Enable for Master 15</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PRAS1</name>
               <description>Priority Register A for Slave 1</description>
               <addressOffset>0x0088</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>M0PR</name>
                     <description>Master 0 Priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN0</name>
                     <description>Latency Quality of Service Enable for Master 0</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M1PR</name>
                     <description>Master 1 Priority</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN1</name>
                     <description>Latency Quality of Service Enable for Master 1</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M2PR</name>
                     <description>Master 2 Priority</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN2</name>
                     <description>Latency Quality of Service Enable for Master 2</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M3PR</name>
                     <description>Master 3 Priority</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN3</name>
                     <description>Latency Quality of Service Enable for Master 3</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M4PR</name>
                     <description>Master 4 Priority</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN4</name>
                     <description>Latency Quality of Service Enable for Master 4</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M5PR</name>
                     <description>Master 5 Priority</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN5</name>
                     <description>Latency Quality of Service Enable for Master 5</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M6PR</name>
                     <description>Master 6 Priority</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN6</name>
                     <description>Latency Quality of Service Enable for Master 6</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M7PR</name>
                     <description>Master 7 Priority</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN7</name>
                     <description>Latency Quality of Service Enable for Master 7</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PRBS1</name>
               <description>Priority Register B for Slave 1</description>
               <addressOffset>0x008C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>M8PR</name>
                     <description>Master 8 Priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN8</name>
                     <description>Latency Quality of Service Enable for Master 8</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M9PR</name>
                     <description>Master 9 Priority</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN9</name>
                     <description>Latency Quality of Service Enable for Master 9</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M10PR</name>
                     <description>Master 10 Priority</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN10</name>
                     <description>Latency Quality of Service Enable for Master 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M11PR</name>
                     <description>Master 11 Priority</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN11</name>
                     <description>Latency Quality of Service Enable for Master 11</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M12PR</name>
                     <description>Master 12 Priority</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN12</name>
                     <description>Latency Quality of Service Enable for Master 12</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M13PR</name>
                     <description>Master 13 Priority</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN13</name>
                     <description>Latency Quality of Service Enable for Master 13</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M14PR</name>
                     <description>Master 14 Priority</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN14</name>
                     <description>Latency Quality of Service Enable for Master 14</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M15PR</name>
                     <description>Master 15 Priority</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN15</name>
                     <description>Latency Quality of Service Enable for Master 15</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
