Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.1.98/samrh71c/svd/ATSAMRH71F20C.svd
            <register>
               <name>MATRIX_PSR12</name>
               <description>Protection Slave 0 Register 12</description>
               <addressOffset>0x230</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LAUSERH0</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH1</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH2</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH3</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH4</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH5</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH6</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH7</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH0</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH1</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH2</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH3</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH4</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH5</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH6</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH7</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH0</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH1</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH2</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH3</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH4</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH5</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH6</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH7</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA0</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA1</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA2</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA3</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA4</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA5</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA6</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA7</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PSR13</name>
               <description>Protection Slave 0 Register 13</description>
               <addressOffset>0x234</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LAUSERH0</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH1</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH2</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH3</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH4</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH5</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH6</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH7</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH0</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH1</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH2</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH3</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH4</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH5</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH6</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH7</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH0</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH1</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH2</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH3</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH4</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH5</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH6</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH7</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA0</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA1</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA2</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA3</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA4</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA5</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA6</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA7</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
