Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.1.98/samrh71c/svd/ATSAMRH71F20C.svd
            <register>
               <name>MATRIX_PASSR11</name>
               <description>Protected Areas Split Slave 0 Register 11</description>
               <addressOffset>0x26C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PASPLIT0</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT1</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT2</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT3</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT4</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT5</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT6</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT7</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PASSR12</name>
               <description>Protected Areas Split Slave 0 Register 12</description>
               <addressOffset>0x270</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PASPLIT0</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT1</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT2</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT3</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT4</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT5</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT6</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT7</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PASSR13</name>
               <description>Protected Areas Split Slave 0 Register 13</description>
               <addressOffset>0x274</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PASPLIT0</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT1</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT2</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT3</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT4</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT5</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT6</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT7</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PASSR14</name>
               <description>Protected Areas Split Slave 0 Register 14</description>
               <addressOffset>0x278</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PASPLIT0</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT1</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT2</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT3</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT4</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT5</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT6</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT7</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PASSR15</name>
               <description>Protected Areas Split Slave 0 Register 15</description>
               <addressOffset>0x27C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PASPLIT0</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT1</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT2</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT3</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT4</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT5</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT6</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT7</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PRTSR0</name>
               <description>Protected Region Top Slave 0 Register 0</description>
               <addressOffset>0x280</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PRTOP0</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP1</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP2</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP3</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP4</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP5</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP6</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP7</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PRTSR1</name>
               <description>Protected Region Top Slave 0 Register 1</description>
               <addressOffset>0x284</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PRTOP0</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP1</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP2</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP3</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP4</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP5</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP6</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP7</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PRTSR2</name>
               <description>Protected Region Top Slave 0 Register 2</description>
               <addressOffset>0x288</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PRTOP0</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP1</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP2</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP3</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP4</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP5</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP6</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP7</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PRTSR3</name>
               <description>Protected Region Top Slave 0 Register 3</description>
               <addressOffset>0x28C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PRTOP0</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP1</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP2</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP3</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP4</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP5</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP6</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP7</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
