Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.1.98/samrh71c/svd/ATSAMRH71F20C.svd
            <register>
               <name>PMC_PLL_CFG</name>
               <description>PLL Configuration Register</description>
               <addressOffset>0x0080</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OUTCUR_PLLA</name>
                     <description>PLLA Output Current</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>OUTCUR_PLLASelect</name>
                        <enumeratedValue>
                           <name>ICP0</name>
                           <description>0.5 mA</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ICP1</name>
                           <description>0.75 mA</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ICP2</name>
                           <description>1 mA</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ICP3</name>
                           <description>1.25 mA</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SCA</name>
                     <description>Internal Filter PLL - Select Internal Capaticance Value</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SCASelect</name>
                        <enumeratedValue>
                           <name>SC_VAL_20p</name>
                           <description>20 pF</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SC_VAL_40p</name>
                           <description>40 pF</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SC_VAL_30p</name>
                           <description>30 pF</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SC_VAL_60p</name>
                           <description>60 pF</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRA</name>
                     <description>Internal Filter PLL - Select Internal Resistor Value</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SRASelect</name>
                        <enumeratedValue>
                           <name>SR_VAL_24K</name>
                           <description>24 Ohms</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SR_VAL_6K</name>
                           <description>6 Ohms</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SR_VAL_3K</name>
                           <description>3 Ohms</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SR_VAL_12K</name>
                           <description>12 Ohms</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OUTCUR_PLLB</name>
                     <description>PLLB Output Current</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>OUTCUR_PLLBSelect</name>
                        <enumeratedValue>
                           <name>ICP0</name>
                           <description>0.5 mA</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ICP1</name>
                           <description>0.75 mA</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ICP2</name>
                           <description>1 mA</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ICP3</name>
                           <description>1.25 mA</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SCB</name>
                     <description>Internal Filter PLL - Select Internal Capaticance Value</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SCBSelect</name>
                        <enumeratedValue>
                           <name>SC_VAL_20p</name>
                           <description>20 pF</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SC_VAL_40p</name>
                           <description>40 pF</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SC_VAL_30p</name>
                           <description>30 pF</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SC_VAL_60p</name>
                           <description>60 pF</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRB</name>
                     <description>Internal Filter PLL - Select Internal Resistor Value</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SRBSelect</name>
                        <enumeratedValue>
                           <name>SR_VAL_24K</name>
                           <description>24 Ohms</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SR_VAL_6K</name>
                           <description>6 Ohms</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SR_VAL_3K</name>
                           <description>3 Ohms</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SR_VAL_12K</name>
                           <description>12 Ohms</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PMC_WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0x00E4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPITEN</name>
                     <description>Write Protection Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.</description>
                           <value>0x504D43</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PMC_WPSR</name>
               <description>Write Protection Status Register</description>
               <addressOffset>0x00E8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PMC_PCR</name>
               <description>Peripheral Control Register</description>
               <addressOffset>0x010C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PID</name>
                     <description>Peripheral ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>GCLKCSS</name>
                     <description>Generic Clock Source Selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>GCLKCSSSelect</name>
                        <enumeratedValue>
                           <name>SLOW_CLK</name>
                           <description>MD_SLCK is selected</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MAIN_CLK</name>
                           <description>MAINCK is selected</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLLA_CLK</name>
                           <description>PLLACK is selected</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLLB_CLK</name>
                           <description>PLLBCK is selected</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MCK_CLK</name>
                           <description>MCK is selected</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MCK_RC2</name>
                           <description>RC2 is selected</description>
                           <value>0x5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMD</name>
                     <description>Command</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GCLKDIV</name>
                     <description>Generic Clock Division Ratio</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GCLKEN</name>
                     <description>Generic Clock Enable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PMC_OCR1</name>
               <description>Oscillator Calibration Register</description>
               <addressOffset>0x0110</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CAL4</name>
                     <description>Main RC Oscillator Calibration Bits for 4 MHz</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SEL4</name>
                     <description>Selection of Main RC Oscillator Calibration Bits for 4 MHz</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAL8</name>
                     <description>Main RC Oscillator Calibration Bits for 8 MHz</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SEL8</name>
                     <description>Selection of Main RC Oscillator Calibration Bits for 8 MHz</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAL10</name>
                     <description>Main RC Oscillator Calibration Bits for 10 MHz</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SEL10</name>
                     <description>Selection of Main RC Oscillator Calibration Bits for 10 MHz</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAL12</name>
                     <description>Main RC Oscillator Calibration Bits for 12 MHz</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SEL12</name>
                     <description>Selection of Main RC Oscillator Calibration Bits for 12 MHz</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PMC_PMMR</name>
               <description>PLL Maximum Multiplier Value Register</description>
               <addressOffset>0x0130</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PLLA_MMAX</name>
                     <description>PLLA Maximum Allowed Multiplier Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>PLLB_MMAX</name>
                     <description>PLLB Maximum Allowed Multiplier Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PMC_CPULIM</name>
               <description>CPU Monitor Limits Register</description>
               <addressOffset>0x0160</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CPU_LOW_IT</name>
                     <description>CPU Monitoring Low IT Limit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CPU_HIGH_IT</name>
                     <description>CPU Monitoring High IT Limit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CPU_LOW_RES</name>
                     <description>CPU Monitoring Low RESET Limit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CPU_HIGH_RES</name>
                     <description>CPU Monitoring High Reset Limit</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
