Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.1.98/samrh71c/svd/ATSAMRH71F20C.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>SPW</name>
         <version>44126A</version>
         <description>SpW</description>
         <groupName>SPW</groupName>
         <prependToName>SPW_</prependToName>
         <baseAddress>0x40040000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xF0C</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SPW</name>
            <value>65</value>
         </interrupt>
         <registers>
            <register>
               <name>SPW_ROUTER_STS</name>
               <description>SpW Router Status</description>
               <addressOffset>0x0000</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DEST</name>
                     <description>Destination addr</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SOURCE</name>
                     <description>Source address</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>BYTE</name>
                     <description>Router byte</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>COUNT</name>
                     <description>Packet Count</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_CFG</name>
               <description>SpW Router Config</description>
               <addressOffset>0x0004</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LAENA</name>
                     <description>LA Routing Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FALLBACK</name>
                     <description>Fallback Routing</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISTIMEOUT</name>
                     <description>Disable Timeout</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TIMEOUT</name>
               <description>SpW Router Timeout</description>
               <addressOffset>0x0008</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Physical Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>LOCKED</name>
                     <description>Locked</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>224</dim>
               <dimIncrement>4</dimIncrement>
               <name>SPW_ROUTER_TABLE[%s]</name>
               <description>SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32)</description>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_LINK1_PI_RM</name>
               <description>SpW Link 1 Pending Read Masked Interrupt</description>
               <addressOffset>0x400</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DISERR</name>
                     <description>DisErr</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARERR</name>
                     <description>ParErr</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESCERR</name>
                     <description>ESCErr</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRERR</name>
                     <description>CrErr</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINKABORT</name>
                     <description>LinkAbort</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEPTRANS</name>
                     <description>EEP transmitted</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEPREC</name>
                     <description>EEP received</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISCARD</name>
                     <description>Discard</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESCEVENT2</name>
                     <description>Escape Event 2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESCEVENT1</name>
                     <description>Escape Event 1</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_LINK1_PI_RCM</name>
               <description>SpW Link 1 Pending Read and Clear Masked Interrupt</description>
               <addressOffset>0x404</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DISERR</name>
                     <description>DisErr</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARERR</name>
                     <description>ParErr</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESCERR</name>
                     <description>ESCErr</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRERR</name>
                     <description>CrErr</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINKABORT</name>
                     <description>LinkAbort</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEPTRANS</name>
                     <description>EEP transmitted</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEPREC</name>
                     <description>EEP received</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISCARD</name>
                     <description>Discard</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESCEVENT2</name>
                     <description>Escape Event 2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESCEVENT1</name>
                     <description>Escape Event 1</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_LINK1_PI_R</name>
               <description>SpW Link 1 Pending Read Interrupt</description>
               <addressOffset>0x408</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DISERR</name>
                     <description>DisErr</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARERR</name>
                     <description>ParErr</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESCERR</name>
                     <description>ESCErr</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRERR</name>
                     <description>CrErr</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINKABORT</name>
                     <description>LinkAbort</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEPTRANS</name>
                     <description>EEP transmitted</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEPREC</name>
                     <description>EEP received</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISCARD</name>
                     <description>Discard</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESCEVENT2</name>
                     <description>Escape Event 2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESCEVENT1</name>
                     <description>Escape Event 1</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_LINK1_PI_RCS</name>
               <description>SpW Link 1 Pending Read, Clear and Enabed Interrupt</description>
               <addressOffset>0x40C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DISERR</name>
                     <description>DisErr</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARERR</name>
                     <description>ParErr</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESCERR</name>
                     <description>ESCErr</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRERR</name>
                     <description>CrErr</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINKABORT</name>
                     <description>LinkAbort</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEPTRANS</name>
                     <description>EEP transmitted</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEPREC</name>
                     <description>EEP received</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISCARD</name>
                     <description>Discard</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESCEVENT2</name>
                     <description>Escape Event 2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESCEVENT1</name>
                     <description>Escape Event 1</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_LINK1_IM</name>
               <description>SpW Link 1 Interrupt Mask</description>
               <addressOffset>0x410</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DISERR</name>
                     <description>DisErr</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARERR</name>
                     <description>ParErr</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESCERR</name>
                     <description>ESCErr</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRERR</name>
                     <description>CrErr</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINKABORT</name>
                     <description>LinkAbort</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEPTRANS</name>
                     <description>EEP transmitted</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEPREC</name>
                     <description>EEP received</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISCARD</name>
                     <description>Discard</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESCEVENT2</name>
                     <description>Escape Event 2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESCEVENT1</name>
                     <description>Escape Event 1</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_LINK1_PI_C</name>
               <description>SpW Link 1 Clear Pending Interrupt</description>
               <addressOffset>0x414</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DISERR</name>
                     <description>DisErr</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARERR</name>
                     <description>ParErr</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESCERR</name>
                     <description>ESCErr</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRERR</name>
                     <description>CrErr</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINKABORT</name>
                     <description>LinkAbort</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEPTRANS</name>
                     <description>EEP transmitted</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEPREC</name>
                     <description>EEP received</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISCARD</name>
                     <description>Discard</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESCEVENT2</name>
                     <description>Escape Event 2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESCEVENT1</name>
                     <description>Escape Event 1</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
