Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.1.98/samrh71c/svd/ATSAMRH71F20C.svd
            <register>
               <name>SPW_LINK1_IM_S</name>
               <description>SpW Link 1 Interrupt Set Mask</description>
               <addressOffset>0x418</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DISERR</name>
                     <description>DisErr</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARERR</name>
                     <description>ParErr</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESCERR</name>
                     <description>ESCErr</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRERR</name>
                     <description>CrErr</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINKABORT</name>
                     <description>LinkAbort</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEPTRANS</name>
                     <description>EEP transmitted</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEPREC</name>
                     <description>EEP received</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISCARD</name>
                     <description>Discard</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESCEVENT2</name>
                     <description>Escape Event 2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESCEVENT1</name>
                     <description>Escape Event 1</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_LINK1_IM_C</name>
               <description>SpW Link 1 Interrupt Clear Mask</description>
               <addressOffset>0x41C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DISERR</name>
                     <description>DisErr</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARERR</name>
                     <description>ParErr</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESCERR</name>
                     <description>ESCErr</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRERR</name>
                     <description>CrErr</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINKABORT</name>
                     <description>LinkAbort</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEPTRANS</name>
                     <description>EEP transmitted</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEPREC</name>
                     <description>EEP received</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISCARD</name>
                     <description>Discard</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESCEVENT2</name>
                     <description>Escape Event 2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESCEVENT1</name>
                     <description>Escape Event 1</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_LINK1_CFG</name>
               <description>SpW Link 1 Config</description>
               <addressOffset>0x420</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>COMMAND</name>
                     <description>Command</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>COMMANDSelect</name>
                        <enumeratedValue>
                           <name>LINK_DISABLE</name>
                           <description>The link proceeds directly to the ErrorReset state when reaching the Run state.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_COMMAND</name>
                           <description>State is not actively changed.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AUTO_START</name>
                           <description>The Codec will wait in state Ready until the first NULL character is received.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LINK_START</name>
                           <description>SpaceWire link can proceed to Started state.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_LINK1_CLKDIV</name>
               <description>SpW Link 1 Clock Division</description>
               <addressOffset>0x424</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TXOPERDIV</name>
                     <description>TxOperDiv</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TXINITDIV</name>
                     <description>TxInitDiv</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_LINK1_STATUS</name>
               <description>SpW Link 1 Status</description>
               <addressOffset>0x428</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>LINKSTATE</name>
                     <description>LinkState</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>LINKSTATESelect</name>
                        <enumeratedValue>
                           <name>ERRORRESET</name>
                           <description>CODEC link state machine in ErrorReset state</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERRORWAIT</name>
                           <description>CODEC link state machine in ErrorWait state</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>READY</name>
                           <description>CODEC link state machine in Ready state</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STARTED</name>
                           <description>CODEC link state machine in Started state</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CONNECTING</name>
                           <description>CODEC link state machine in Connecting state</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RUN</name>
                           <description>CODEC link state machine in Run state</description>
                           <value>0x5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXDEFDIV</name>
                     <description>TxDefDiv</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>TxEmpty</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GOTNULL</name>
                     <description>GotNull</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GOTFCT</name>
                     <description>GotFCT</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GOTNCHAR</name>
                     <description>GotNChar</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SEEN0</name>
                     <description>SEEN0</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SEEN1</name>
                     <description>SEEN1</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SEEN2</name>
                     <description>SEEN2</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SEEN3</name>
                     <description>SEEN3</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SEEN4</name>
                     <description>SEEN4</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SEEN5</name>
                     <description>SEEN5</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_LINK1_SWRESET</name>
               <description>SpW Link 1 Software Reset</description>
               <addressOffset>0x42C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PATTERN</name>
                     <description>Pattern</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_LINK1_ESCCHAREVENT0</name>
               <description>SpW Link 1 Escape Character Event 0</description>
               <addressOffset>0x430</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MASK</name>
                     <description>Mask</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ACTIVE</name>
                     <description>Active</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HWEVENT</name>
                     <description>HwEvent</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_LINK1_ESCCHAREVENT1</name>
               <description>SpW Link 1 Escape Character Event 1</description>
               <addressOffset>0x434</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MASK</name>
                     <description>Mask</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ACTIVE</name>
                     <description>Active</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HWEVENT</name>
                     <description>HwEvent</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_LINK1_ESCCHARSTS</name>
               <description>SpW Link 1 Escape Character Status</description>
               <addressOffset>0x438</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CHAR1</name>
                     <description>Esc Char 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CHAR2</name>
                     <description>Esc Char 2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_LINK1_TRANSESC</name>
               <description>SpW Link 1 Transmit Escape Character</description>
               <addressOffset>0x43C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CHAR</name>
                     <description>Character</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
