Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.1.98/samrh71c/svd/ATSAMRH71F20C.svd
            <register>
               <name>SPW_LINK2_DISTACKPI_C</name>
               <description>SpW Link 2 Distributed Interrupt Acknowledge Clear Pending Interrupt</description>
               <addressOffset>0x4F4</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DA0</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA1</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA2</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA3</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA4</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA5</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA6</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA7</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA8</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA9</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA10</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA11</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA12</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA13</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA14</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA15</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA16</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA17</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA18</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA19</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA20</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA21</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA22</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA23</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA24</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA25</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA26</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA27</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA28</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA29</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA30</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA31</name>
                     <description>Distributed Acknowledge</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_LINK2_DISTACKIM_S</name>
               <description>SpW Link 2 Distributed Interrupt Acknowledge Set Mask</description>
               <addressOffset>0x4F8</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DA0</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA1</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA2</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA3</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA4</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA5</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA6</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA7</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA8</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA9</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA10</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA11</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA12</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA13</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA14</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA15</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA16</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA17</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA18</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA19</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA20</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA21</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA22</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA23</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA24</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA25</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA26</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA27</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA28</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA29</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA30</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DA31</name>
                     <description>Distributed Acknowledge mask</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
