Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.1.98/samrh71c/svd/ATSAMRH71F20C.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>SUPC</name>
         <version>44082C</version>
         <description>Supply Controller</description>
         <groupName>SUPC</groupName>
         <prependToName>SUPC_</prependToName>
         <baseAddress>0x40100210</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xD8</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SUPC</name>
            <value>0</value>
         </interrupt>
         <registers>
            <register>
               <name>SUPC_CR</name>
               <description>Supply Controller Control Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ZERO</name>
                     <description>Shall be always write at '0'</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TDXTALSEL</name>
                     <description>Timing Domain Crystal Oscillator Select</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TDXTALSELSelect</name>
                        <enumeratedValue>
                           <name>NO_EFFECT</name>
                           <description>No effect.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRYSTAL_SEL</name>
                           <description>If KEY is correct, XTALSEL switches the slow clock of the timing domain (TD_SLCK) on the 32.768 kHz crystal oscillator output.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MDRCSEL</name>
                     <description>Monitoring Domain RC Oscillator Select</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MDRCSELSelect</name>
                        <enumeratedValue>
                           <name>NO_EFFECT</name>
                           <description>No effect.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRYSTAL_SEL</name>
                           <description>If KEY is correct, XTALSEL switches the slow clock of the monitoring domain (MD_SLCK) on the slow RC oscillator output.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Password</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation.</description>
                           <value>0xA5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUPC_SMMR</name>
               <description>Supply Controller Supply Monitor Mode Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CORESMUSEL</name>
                     <description>Core Supply Monitor User Selection</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUPC_MR</name>
               <description>Supply Controller Mode Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CORSMRSTEN</name>
                     <description>VDDCORE Supply Monitor Reset Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CORSMRSTENSelect</name>
                        <enumeratedValue>
                           <name>NOT_ENABLE</name>
                           <description>The core reset signal vddcore_nreset is not affected when a VDDCORE supply monitor detection occurs.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The core reset signal, vddcore_nreset is asserted when a VDDCORE supply monitor detection occurs.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CORSMDIS</name>
                     <description>VDDCORE Supply Monitor Disable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CORSMDISSelect</name>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The VDDCORE supply monitor is enabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>The VDDCORE supply monitor is disabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OSCBYPASS</name>
                     <description>Oscillator Bypass</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>OSCBYPASSSelect</name>
                        <enumeratedValue>
                           <name>NO_EFFECT</name>
                           <description>No effect. Clock selection depends on the value of XTALSEL (SUPC_CR).</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BYPASS</name>
                           <description>The 32.768 kHz crystal oscillator is bypassed if XTALSEL (SUPC_CR) is set. OSCBYPASS must be set prior to setting XTALSEL.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FXTALSTUP</name>
                     <description>Fast Startup 32.768 kHz Crystal Oscillator</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Password Key</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation.</description>
                           <value>0xA5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUPC_SR</name>
               <description>Supply Controller Status Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CORSMRSTS</name>
                     <description>VDDCORE Supply Monitor Reset Status (cleared on read)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CORSMRSTSSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No VDDCORE Supply Monitor reset event has been detected since the last read of the SUPC_SR.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PRESENT</name>
                           <description>At least one VDDCORE Supply Monitor reset event has been detected since the last read of the SUPC_SR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TDOSCSEL</name>
                     <description>32 kHz Oscillator Selection Status</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TDOSCSELSelect</name>
                        <enumeratedValue>
                           <name>RC</name>
                           <description>The timing domain slow clock, TD_SLCK, is generated by the slow RC oscillator.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRYST</name>
                           <description>The timing domain slow clock, TD_SLCK, is generated by the 32.768 kHz crystal oscillator.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUPC_PWR</name>
               <description>Supply Controller Power Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ZERO</name>
                     <description>MD_SLCK always generated by the slow RC oscillator</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSC_WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0xD4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.</description>
                           <value>0x525443</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
