Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/2.1.98/samrh71c/svd/ATSAMRH71F20C.svd
            <register>
               <name>XDMAC_GRWR</name>
               <description>Global Channel Read Write Resume Register</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RWR0</name>
                     <description>XDMAC Channel 0 Read Write Resume Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR1</name>
                     <description>XDMAC Channel 1 Read Write Resume Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR2</name>
                     <description>XDMAC Channel 2 Read Write Resume Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR3</name>
                     <description>XDMAC Channel 3 Read Write Resume Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR4</name>
                     <description>XDMAC Channel 4 Read Write Resume Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR5</name>
                     <description>XDMAC Channel 5 Read Write Resume Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR6</name>
                     <description>XDMAC Channel 6 Read Write Resume Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR7</name>
                     <description>XDMAC Channel 7 Read Write Resume Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR8</name>
                     <description>XDMAC Channel 8 Read Write Resume Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR9</name>
                     <description>XDMAC Channel 9 Read Write Resume Bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR10</name>
                     <description>XDMAC Channel 10 Read Write Resume Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR11</name>
                     <description>XDMAC Channel 11 Read Write Resume Bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR12</name>
                     <description>XDMAC Channel 12 Read Write Resume Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR13</name>
                     <description>XDMAC Channel 13 Read Write Resume Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR14</name>
                     <description>XDMAC Channel 14 Read Write Resume Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR15</name>
                     <description>XDMAC Channel 15 Read Write Resume Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR16</name>
                     <description>XDMAC Channel 16 Read Write Resume Bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR17</name>
                     <description>XDMAC Channel 17 Read Write Resume Bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR18</name>
                     <description>XDMAC Channel 18 Read Write Resume Bit</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR19</name>
                     <description>XDMAC Channel 19 Read Write Resume Bit</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR20</name>
                     <description>XDMAC Channel 20 Read Write Resume Bit</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR21</name>
                     <description>XDMAC Channel 21 Read Write Resume Bit</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR22</name>
                     <description>XDMAC Channel 22 Read Write Resume Bit</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR23</name>
                     <description>XDMAC Channel 23 Read Write Resume Bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR24</name>
                     <description>XDMAC Channel 24 Read Write Resume Bit</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR25</name>
                     <description>XDMAC Channel 25 Read Write Resume Bit</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR26</name>
                     <description>XDMAC Channel 26 Read Write Resume Bit</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR27</name>
                     <description>XDMAC Channel 27 Read Write Resume Bit</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR28</name>
                     <description>XDMAC Channel 28 Read Write Resume Bit</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR29</name>
                     <description>XDMAC Channel 29 Read Write Resume Bit</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR30</name>
                     <description>XDMAC Channel 30 Read Write Resume Bit</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR31</name>
                     <description>XDMAC Channel 31 Read Write Resume Bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>XDMAC_GSWR</name>
               <description>Global Channel Software Request Register</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>SWREQ0</name>
                     <description>XDMAC Channel 0 Software Request Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ1</name>
                     <description>XDMAC Channel 1 Software Request Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ2</name>
                     <description>XDMAC Channel 2 Software Request Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ3</name>
                     <description>XDMAC Channel 3 Software Request Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ4</name>
                     <description>XDMAC Channel 4 Software Request Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ5</name>
                     <description>XDMAC Channel 5 Software Request Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ6</name>
                     <description>XDMAC Channel 6 Software Request Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ7</name>
                     <description>XDMAC Channel 7 Software Request Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ8</name>
                     <description>XDMAC Channel 8 Software Request Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ9</name>
                     <description>XDMAC Channel 9 Software Request Bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ10</name>
                     <description>XDMAC Channel 10 Software Request Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ11</name>
                     <description>XDMAC Channel 11 Software Request Bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ12</name>
                     <description>XDMAC Channel 12 Software Request Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ13</name>
                     <description>XDMAC Channel 13 Software Request Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ14</name>
                     <description>XDMAC Channel 14 Software Request Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ15</name>
                     <description>XDMAC Channel 15 Software Request Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ16</name>
                     <description>XDMAC Channel 16 Software Request Bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ17</name>
                     <description>XDMAC Channel 17 Software Request Bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ18</name>
                     <description>XDMAC Channel 18 Software Request Bit</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ19</name>
                     <description>XDMAC Channel 19 Software Request Bit</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ20</name>
                     <description>XDMAC Channel 20 Software Request Bit</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ21</name>
                     <description>XDMAC Channel 21 Software Request Bit</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ22</name>
                     <description>XDMAC Channel 22 Software Request Bit</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ23</name>
                     <description>XDMAC Channel 23 Software Request Bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ24</name>
                     <description>XDMAC Channel 24 Software Request Bit</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ25</name>
                     <description>XDMAC Channel 25 Software Request Bit</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ26</name>
                     <description>XDMAC Channel 26 Software Request Bit</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ27</name>
                     <description>XDMAC Channel 27 Software Request Bit</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ28</name>
                     <description>XDMAC Channel 28 Software Request Bit</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ29</name>
                     <description>XDMAC Channel 29 Software Request Bit</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ30</name>
                     <description>XDMAC Channel 30 Software Request Bit</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ31</name>
                     <description>XDMAC Channel 31 Software Request Bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
